Revit 2027 API
TableCellStyleOverrideOptions.BorderTopLineStyle Property
 Indicates if the border top line style characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool BorderTopLineStyle { get; set; }
Public Property BorderTopLineStyle As Boolean
	Get
	Set
public:
property bool BorderTopLineStyle {
	bool get ();
	void set (bool value);
}
member BorderTopLineStyle : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace